tests/load/artillery-config.yml

# tests/load/artillery-config.yml
config:
  target: "https://geo-availability.workers.dev" # Replace with actual deployed worker URL
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      rampTo: 100
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 100
      name: "Sustained load"
  processors: "./functions.js" # If needed for dynamic data generation logic beyond inline
  payload:
    # CSV or inline data source could go here
    # For now generating random in scenarios
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Check Service Availability"
    flow:
      - get:
          url: "/availability/check?service={{ $randomString() }}&pincode={{ $randomNumber(100000, 999999) }}"
          capture:
            - json: "$.cache_hit"
              as: "cache_hit"
          expect:
            - statusCode: 200
            - contentType: json